Repository: dadaasdcfaw/dada_django
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es_es

# back_button_text
source: Back
es_es: Volver

# footer_contact_header
source: Contact
es_es: Contacto

# footer_academic_title
source: Software Engineer
es_es: Ingeniero de Software

# footer_copyright_icons
source: Animated button icons created by Freepik - Flaticon
es_es: Iconos animados de los botones creados por Freepik - Flaticon

# favicon_credit_0
source: Favicon licensed under
es_es: Favicon bajo licencia

# bot_pro_page_title
source: Pokémon Revolution Online bot. How it was nade
es_es: Pokémon Revolution Online bot. Cómo se hizo

# disclaimer_text
source: When it comes to online videogames, tools like this one have devastating effects. They make the game less enjoyable for both the fair player and the cheater. This bot was made for didactic purposes exclusively. It was never available for download and never will be.
es_es: Al tratarse de un videojuego en línea, herramientas como esta tienen efectos muy negativos en la salud del mismo. El bot no se encuentra disponible para descarga, ni ahora ni nunca. En su momento, se desarrolló con fines meramente didácticos.

# bot_context_header
source: Context
es_es: Contexto

# bot_general_0
source: Pokémon videogames are based on creatures that players use to fight against each other. These creatures called Pokémon are caught and then trained. Wild Pokémon appear when the player walks around certain areas.
es_es: Los videojuegos de Pokémon están basados en unas criaturas que utilizan los jugadores para combatir. Estas criaturas llamadas Pokémon son capturadas y posteriormente entrenadas. Los Pokémon salvajes aparecen cuando el jugador se mueve por unas zonas determinadas.

# bot_general_1
source: When a Pokémon appears, a battle starts. The battle ends when the player flees or the wild Pokémon is either caught or defeated.
es_es: Cuando un Pokémon aparece, comienza una batalla. La batalla concluye cuando el jugador huye o el Pokémon enemigo es derrotado o capturado.

# bot_general_2
source: Stronger Pokémon species are less frequent, representing 0.1% of encounters in some cases.
es_es: Las especies de Pokémon más fuertes aparecen con menos frecuencia, representando el 0.1% de los encuentros en algunos casos.

# bot_general_3
source: Besides the species of Pokémon that is or are wanted, it is also possible to setup the ability it or they must have. This concepts are later explained.
es_es: Además de la especie o especies de Pokémon a capturar, es posible configurar la habilidad que deben tener.

# bot_wildpokemon_header
source: Wild Pokémon
es_es: Pokémon salvajes

# bot_wildpokemon_0
source: Pokémon have many traits that differenciate inidividuals among the same species. These traits make them better or worse for a certain role within a team.
es_es: Los Pokémon cuentan con numerosos atributos que diferencian a los individuous de la misma especie. Estos atributos hacen que sean mejores o peores para según que rol dentro del equipo.

# bot_wildpokemon_1
source: Wild Pokémon traits are randomly set when they appear, although they remain hidden until the Pokémon is caught. The ability of a wild Pokémon is the only trait that can be known before catching it.
es_es: Los atributos de los Pokémon salvajes se deciden al azar cuando estos aparecen, aunque no se pueden conocer hasta que son capturados. La habilidad de un Pokémon salvaje es el único atributo que sí se puede conocer antes de que sea capturado.

# bot_howitworks_header
source: How it works
es_es: Funcionamiento

# bot_howitworks_0
source: In general terms, the bot makes keyboard inputs in the game like it was a person. The keys pressed depend on the information displayed on the screen at any given moment. The subroutines in which the bot does different tasks can be explained as a FSM or Finite-State Machine. The states are synced using multi-threading.
es_es: En líneas generales, el bot introduce entradas de teclado en el juego como si de una persona se tratase, en función de la información que aparece en pantalla en cada momento. Las diferentes subrutinas por las que el bot ejecuta acciones pueden entenderse como una máquina de estados finitos. Los estados se sincronizan usando tecnología multihilo.

# bot_howitworks_1
source: The player must be standing in an area where wild Pokémon spawn. The bot will move the player until a Pokémon encounter occur. When this happens, it is detected that a battle started. Using OCR (Optical Character Recognition), the wild Pokémon species is identified. If that species was set to be caught, catching routine starts; if not, the bot ends the battle by running away. Then, in any case, the bot walks around until a new Pokémon appears. In addition to the species and with a certain in-game setup, the bot is able to identify the wild Pokémon's ability.
es_es: El jugador debe estar colocado en una zona donde aparezcan Pokémon salvajes. El bot moverá el personaje hasta que tenga lugar un encuentro. Cuando sucede, se detecta que una batalla ha comenzado.Mediante OCR (Optical Character Recognition), la especie de Pokémon salvaje es identificada. Si se ha especificado capturar esa especie, se inicia la rutina de captura; si no, el bot finaliza el encuentro huyendo. En cualquier caso, se vuelve a andar hasta encontrar otro Pokémon salvaje. Además de la especie y con la configuración adecuada, el bot es capaz de identificar la habilidad del Pokémon salvaje.

# bot_howitworks_2
source: All parameters like direction and amplitude of the path the player will cover can be tuned using this graphic interface. The buttons
es_es: A través de esta interfaz gráfica pueden configurarse todos los parámetros como la dirección y amplitud de desplazamiento. A través de los botones

# bot_howitworks_2_1
source: and
es_es: y

# bot_howitworks_2_2
source: are used to add or remove Pokémon from the list of species that the bot will recognize and catch in-game.
es_es: se pueden añadir o eliminar Pokémon que el bot reconocerá y capturará en el juego.

# bot_howitworks_3
source: The list of Pokémon and its abilities were obtained from a local SQlite database, created via Web Scrapping, from
es_es: La lista de Pokémon y sus habilidades se obtienen de una base de datos local SQlite, creada mediante Web Scrapping desde

# bot_aqui
source: here
es_es: aquí

# bot_howitworks_4
source: There is a counter at the bottom part of the interface. It records the encounters with all the different Pokémon that have taken place during a certain session.
es_es: En la parte inferior de la interfaz se dispone de un contador que registra los encuentros con Pokémon salvajes que han tenido lugar una sesión concreta.

# bot_extra_header
source: Extras
es_es: Funcionalidades adicionales

# bot_pokedex_0
source: With the local database, the Pokédex was recreated. The Pokédex is an in-game tool that stores all the information for all Pokémon.
es_es: Con la base de datos local, se ha recreado la Pokédex.

# bot_pokedex_1
source: A Pokémon can be selected using the drop-down menu, which will generate a SQL query and show the Pokédex info of the chosen Pokémon, alongside his animated sprite.
es_es: A través del menú desplegable se puede seleccionar un Pokémon, lo que generará una consulta SQL a la base de datos y mostrará las estadísticas base del Pokémon en pantalla, junto con su imagen animada.

# bot_telegram_header
source: Telegram
es_es: Bot de Telegram

# bot_telegram_0
source: A Telegram bot was created to keep track of the catches the bot made.
es_es: Paralelamente al bot del juego, se ha creado un bot para Telegram que permite realizar un seguimiento de las capturas.

# bot_telegram_1
source: When a Pokémon is caught, the game provides a preview pop-up that shows the traits of the newly caught Pokémon.
es_es: Cuando se captura un Pokémon, el juego proporciona una vista previa en la que se muestran los atributos del Pokémon recién capturado.

# bot_telegram_2
source: The bots looks for the pop-up, crops the image and sends it to the player's mobile phone.
es_es: El bot busca la vista previa en la pantalla, la recorta y la envía al móvil del jugador por Telegram.

# experience_page_title
source: Experience
es_es: Experiencia

# header_work_experience
source: Work experience
es_es: Experiencia laboral

# job_role
source: Intelligent Transportation Systems Validation Engineer
es_es: Ingeniero de validación de sistemas inteligentes de transporte

# header_proyects
source: Proyects
es_es: Proyectos

# pokemon_bot
source: Task automation bot for the MMO videogame Pokémon Revolution Online
es_es: Bot para automatización de tareas en el videojuego MMO Pokémon Revolution Online

# header_publications
source: Articles
es_es: Publicaciones

# article-title
source: Visibility analysis for the occlusion detection and characterisation in street point clouds acquired with Mobile Laser Scanning
es_es: Análisis de visibilidad para la detección y caracterización de oclusiones en nubes de puntos de entornos urbanos adquiridas con Escaner Láser Móvil (MLS, Mobile Laser Scanning)

# extra_page_title
source: More stuff
es_es: Más Cosas

# header_minigames
source: Minigames
es_es: Minijuegos

# education_page_title
source: Education
es_es: Formación

# header_academic
source: School education
es_es: Formación académica

# degree_name
source: Automation and Industrial Electronics Engineering Degree by University of Vigo
es_es: Grado en Ingeniería Automática y Electrónica por la Universidad de Vigo

# degree_extra_1
source: Programming and design of FPGAs and microcontrollers like Arduino or Microchip's PIC
es_es: Programación y diseño de FPGAs y microcontroladores como Arduino o PIC de Microchip.

# degree_extra_2
source: Baseline knowledge of C, C++, C#, Matlab and Android developing
es_es: Nociones básicas de C, C++, C#, Matlab y desarrollo Android.

# header_aditional_knowledge
source: Additional education
es_es: Formación adicional

# multi_thread
source: Multi-threading
es_es: Programación multi-hilo

# django_description_0
source: Multilingual support
es_es: Soporte multilingüe

# django_description_1
source: Automated tests
es_es: Tests automáticos

# django_description_2
source: Template rendering attending to parameters
es_es: Renderización de plantillas según parámetros

# django_description_3
source: HTML code block reuse
es_es: Reutilización de bloques de código HTML

# aws_ec2
source: EC2 instances
es_es: Instancias EC2

# aws_lambda
source: Lambda functions
es_es: Funciones Lambda

# aws_budget
source: Budgets
es_es: Presupuestos

# web_langs_description
source: All these languages but PHP were used during the development of this website
es_es: Estos lenguajes, salvo PHP, fueron utilizados durante el desarrollo de esta web.

# csharp_lang_description
source: 2 months of autonomous experience in Unity development enviroment
es_es: 2 meses de aprendizaje autónomo en el entorno de desarrollo Unity.

# foto_texto_0
source: Trip to Rome
es_es: Viaje a Roma

# foto_texto_1
source: Pipo and me
es_es: Pipo y yo

# foto_texto_2
source: My best curry ever
es_es: Mi mejor curry

# index_page_title
source: Start
es_es: Inicio

# index_button_education
source: Education
es_es: Formación

# index_button_experience
source: Experience
es_es: Experiencia

# index_button_extrastuff
source: More stuff
es_es: Más cosas

source: About me
es_es: Sobre mí

# index_me_description_0
source: I am Jose and I am 24 years old. I am from Salceda de Caselas, a town near Vigo. Pizza is my favourite but I do not eat it too often so it can be even more favourite.
es_es: Me llamo Jose y tengo 24 años. Soy natural de Salceda de Caselas, un pueblo cerca de Vigo. La pizza es mi comida favorita pero no la como muy a menudo para que sea aún más favorita.

# index_me_description_1
source: I love travelling, cooking and videogames. If I am not coding I am likely doing one of these three things. I enjoy reading too.
es_es: Me encanta viajar, la cocina y los videojuegos. Si no estoy programando, quizás esté haciendo alguna de estas tres cosas. También me gusta mucho leer.

# index_me_description_2
source: I speak Spanish and Galician alike, both are my mother tongues. I have full proficiency of English and I am also learning German. In 2020 I worked as an Aupair for month and a half while attending language school at the same time. When my German gets better, learning French will be my next goal.
es_es: Hablo español y gallego indistintamente, son mis lenguas nativas. Domino el inglés y ahora estoy estudiando alemán. En 2020 trabajé en Köln como Aupair durante un mes y medio, a la vez que aprendía alemán en la escuela de idiomas. Cuando me defienda un poquito mejor, mi siguiente objetivo será el francés.

# index_me_description_3
source: I currently work as a full-time Python dev, since it is the language I am most comfortable with. I got baseline knowledge of other languages, but I did not use them in a job yet.
es_es: Ahora mismo trabajo como desarrollador Python a tiempo completo, es el idioma en el que me siento más cómodo. Tengo nociones básicas de otros lenguajes pero aún no he llegado a desenvolverlos profesionalmente.

# index_me_description_4
source: My CV is available in
es_es: Puedes descargar mi CV en

# index_me_description_5
source: Spanish
es_es: español

# index_me_description_6
source: and in
es_es: y en

# index_me_description_7
source: English
es_es: inglés

# only_desktop_page_title
source: Oops! There is a problem
es_es: Uy! Hay un problema...

# only_desktop_msg
source: This page is only available for PC. I'm sorry.
es_es: Esta página sólo está disponible en ordenador. Lo siento.
